АлогистикТест2/src/Documents/алк_УстановкаЦенНаЛесопродукцию/алк_УстановкаЦенНаЛесопродукцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_УстановкаЦенНаЛесопродукцию</name>
  <registerRecords>InformationRegister.алк_ЦеныНаЛесопродукциюТД</registerRecords>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Прейскурант</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Некондиция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.Градации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияОтправления</name>
      <type>
        <types>CatalogRef.алк_ЛогистическиеЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидТранспортировки</name>
      <type>
        <types>EnumRef.алк_ВидыТранспортировки</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Enums/алк_ВидыТранспортировки/алк_ВидыТранспортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>алк_ВидыТранспортировки</name>
  <enumValues>
    <name>Автомобильная</name>
  </enumValues>
  <enumValues>
    <name>Железнодорожная</name>
  </enumValues>
  <enumValues>
    <name>Теплоход</name>
  </enumValues>
</mdclass:Enum>

АлогистикТест2/src/Documents/алк_УстановкаЦенНаЛесопродукцию/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаУстановкаЦен, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Номенклатура,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Порода,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Сорт,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Некондиция,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Длина,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Градация,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СтанцияОтправления,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.ВидТранспортировки,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Цена,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СтавкаНДС,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СуммаНДС,
		|	&Период,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Всего
		|ИЗ
		|	Документ.алк_УстановкаЦенНаЛесопродукцию.Прейскурант КАК алк_УстановкаЦенНаЛесопродукциюПрейскурант
		|ГДЕ
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаУстановкаЦен.Ссылка);
		Запрос.УстановитьПараметр("Период", ДокументСсылкаУстановкаЦен.Дата);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЦеныНаЛесопродукцию", МассивРезультатов[0].Выгрузить());
		
		
		
	КонецПроцедуры // ИнициализироватьДанныеДокумента()
	
	#КонецОбласти
	
	
	#Область ИнтерфейсПечати
	
	// Сформировать печатные формы объектов
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
		//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТТН") Тогда
		// 
		// УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ТТН", "1-Т (Товарно-транспортная накладная)", Обработки.алк_ПечатьТТН.ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ПараметрыПечати));
		// 
		//КонецЕсли;
		
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Прайс") Тогда
			
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Прайс", "Прайс.", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "Прайс"));
			
		КонецЕсли;
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Прайс";
		КомандаПечати.Представление = НСтр("ru = 'Прайс.'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 1;
		
		//КомандаПечати = КомандыПечати.Добавить();
		//КомандаПечати.Обработчик = "РфпКлиент.ПечатьТН";
		//КомандаПечати.Идентификатор = "ТН";
		//КомандаПечати.Представление = НСтр("ru = 'Приложение №4 (Товарная накладная)'");
		//КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		//КомандаПечати.Порядок = 23;
		
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов
	//
	Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
		
		Перем Ошибки;
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		ПервыйДокумент = Истина;
		
		Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			Если ИмяМакета = "Прайс" Тогда
				
				СформироватьПрайс(ТабличныйДокумент, ТекущийДокумент);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
		Возврат ТабличныйДокумент;
		
	КонецФункции // ПечатнаяФорма()
	
	// Процедура формирования Прайса
	//
	Процедура СформироватьПрайс(ТабличныйДокумент, ТекущийДокумент)
		
		Ссылка = ТекущийДокумент.Ссылка;
		
		МакетАкта = УправлениеПечатью.МакетПечатнойФормы("Документ.алк_УстановкаЦенНаЛесопродукцию.Прайс");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Ссылка,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СтанцияОтправления,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.ВидТранспортировки КАК Транспорт,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Сорт,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Градация,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Цена,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Длина,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Порода,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СуммаНДС КАК НДС,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Всего КАК ЦенаНДС
		|ИЗ
		|	Документ.алк_УстановкаЦенНаЛесопродукцию.Прейскурант КАК алк_УстановкаЦенНаЛесопродукциюПрейскурант
		|ГДЕ
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Ссылка.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.СтанцияОтправления,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Порода,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Длина,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Сорт,
		|	алк_УстановкаЦенНаЛесопродукциюПрейскурант.Градация";
		
		Запрос.УстановитьПараметр("Ссылка",	Ссылка);
		
		т = Запрос.Выполнить().Выгрузить();	
		
		тт = т.скопировать(); тт.Свернуть("Транспорт","");
				
		макет = ПолучитьМакет("Прайс");
		облШапка = макет.ПолучитьОбласть("Шапка");
		облСтрока = макет.ПолучитьОбласть("Строка");
		облПодвал = макет.ПолучитьОбласть("Подвал");
		
		облПодвал.Параметры.Заполнить(ссылка);
		облШапка.Параметры.Заполнить(ссылка);
		облШапка.Параметры.период = ПредставлениеПериода(ссылка.ДатаС, КонецДня(ссылка.ДатаПо));
		облШапка.Параметры.дата = формат(ссылка.ДатаПо,"ДФ=dd.MM.yyyy");
		облСтрока.Параметры.период = облШапка.Параметры.период;
		
		
		Для каждого Транспорт Из тт Цикл
			если Транспорт.Транспорт = Перечисления.алк_ВидыТранспортировки.Железнодорожная тогда
				стр = "ж/д вагонами";
			иначеесли Транспорт.Транспорт = Перечисления.алк_ВидыТранспортировки.Автомобильная тогда
				стр = "автотранспотом";
			иначеесли Транспорт.Транспорт = Перечисления.алк_ВидыТранспортировки.Теплоход тогда
				стр = "баржами";
			конецесли;
			облШапка.Параметры.Транспорт = стр;
			ТабличныйДокумент.Вывести(облШапка);
			
			
			м = т.найтистроки(новый Структура("Транспорт", Транспорт.Транспорт));
			Для каждого э Из м Цикл
				
				облСтрока.Параметры.Заполнить(э);
				ТабличныйДокумент.Вывести(облСтрока);
				
				
			КонецЦикла;
			ТабличныйДокумент.Вывести(облПодвал);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		ТабличныйДокумент.ОтображатьЗаголовки=Ложь;
		ТабличныйДокумент.ОтображатьСетку=ложь;
		
		ТабличныйДокумент.МасштабПечати = 70;
		ТабличныйДокумент.ПолеСлева = 0;
		ТабличныйДокумент.ПолеСправа = 0;
		
	КонецПроцедуры //СформироватьАктПриемки()	
	
	Процедура УстановитьОтбор(Настройки, ИмяПараметра, Значение)
		
		ОбрПараметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
		
		Если ОбрПараметр <> Неопределено Тогда
			
			ОбрПараметр.Использование = Истина;
			ОбрПараметр.Значение      = Значение;
			
		КонецЕсли; 
		
	КонецПроцедуры
	
	#КонецОбласти
	
	
#КонецЕсли


Процедура Конец()		
КонецПроцедуры
